# SQL for Analyst 7 - Common Table Expression (CTE)

In [1]:
# set MySQL URL
user = "dz3vg"
password = ""
host = "localhost"
port = 3306
dbname = "dataapplab_db"
with open("MySQL.key", "r") as file:
    password = file.read()
connection_string = f"mysql+mysqlconnector://{user}:{password}@{host}:{port}/{dbname}"

# connect to MySQL server
%load_ext sql
%sql $connection_string

# clean password
password = ""
connection_string = ""

In [2]:
%%sql

with data_set (col1, col2) as
(
    select 1, 2
        union all
    select 3, 4
)
select
    *
from
    data_set
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
2 rows affected.

[(1, 2), (3, 4)]

In [3]:
%sql use hr;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
0 rows affected.

[]

In [4]:
%%sql

with us_location as
(
    select
        location_id
    from
        locations
    where
        country_id = 'US'
), 
us_department as
(
    select
        department_id
    from
        departments
    where
        location_id in (select location_id from us_location)
), 
us_manager as
(
    select
        employee_id
    from
        employees
    where
        department_id in (select department_id from us_department)
), 
us_employee as
(
    select
        first_name, last_name
    from
        employees
    where
        manager_id in (select employee_id from us_manager)
)
select
    *
from
    us_employee
limit 10
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
10 rows affected.

[('Neena', 'Kochhar'),
 ('Lex', 'De Haan'),
 ('Alexander', 'Hunold'),
 ('Bruce', 'Ernst'),
 ('David', 'Austin'),
 ('Valli', 'Pataballa'),
 ('Diana', 'Lorentz'),
 ('Nancy', 'Greenberg'),
 ('Daniel', 'Faviet'),
 ('John', 'Chen')]

In [5]:
%%sql

with cte1 (txt) as
(
    select 'This '
), 
cte2 (txt) as
(
    select
        concat(cte1.txt, 'is a ')
    from
        cte1
), 
cte3 (txt) as
(
    select 'nice query'
        union
    select 'query that rocks'
        union
    select 'query'
), 
cte4 (txt) as
(
    select
        concat(cte2.txt, cte3.txt)
    from
        cte2, cte3
)
select
    max(txt), min(txt)
from
    cte4
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
1 rows affected.

[('This is a query that rocks', 'This is a nice query')]

In [6]:
%%sql

with recursive cte (n) as
(
    select
        1
        union all
    select
        n + 1
    from
        cte
    where
        n < 10
)
select
    *
from
    cte
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
10 rows affected.

[(1,), (2,), (3,), (4,), (5,), (6,), (7,), (8,), (9,), (10,)]

In [7]:
%%sql

select
    concat(e1.first_name, ' ', e1.last_name) as level1, 
    concat(e2.first_name, ' ', e2.last_name) as level2, 
    concat(e3.first_name, ' ', e3.last_name) as level3, 
    concat(e4.first_name, ' ', e4.last_name) as level4
from
    employees as e1
        left join
    employees as e2 on e2.manager_id = e1.employee_id
        left join
    employees as e3 on e3.manager_id = e2.employee_id
        left join
    employees as e4 on e4.manager_id = e3.employee_id
where
    e1.manager_id = 0 and e4.employee_id is not null
limit 10
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
10 rows affected.

[('Steven King', 'Lex De Haan', 'Alexander Hunold', 'Bruce Ernst'),
 ('Steven King', 'Lex De Haan', 'Alexander Hunold', 'David Austin'),
 ('Steven King', 'Lex De Haan', 'Alexander Hunold', 'Valli Pataballa'),
 ('Steven King', 'Lex De Haan', 'Alexander Hunold', 'Diana Lorentz'),
 ('Steven King', 'Neena Kochhar', 'Nancy Greenberg', 'Daniel Faviet'),
 ('Steven King', 'Neena Kochhar', 'Nancy Greenberg', 'John Chen'),
 ('Steven King', 'Neena Kochhar', 'Nancy Greenberg', 'Ismael Sciarra'),
 ('Steven King', 'Neena Kochhar', 'Nancy Greenberg', 'Jose Manuel Urman'),
 ('Steven King', 'Neena Kochhar', 'Nancy Greenberg', 'Luis Popp'),
 ('Steven King', 'Neena Kochhar', 'Shelley Higgins', 'William Gietz')]

In [8]:
%%sql

with recursive employee_paths as
(
    select
        employee_id, 
        concat(first_name, ' ', last_name) as full_name, 
        concat(first_name, ' ', last_name) as path_name, 
        cast(employee_id as char(200)) as path
    from
        employees
    where
        manager_id = 0
        union all
    select
        e.employee_id, 
        concat(e.first_name, ' ', e.last_name), 
        concat(ep.path_name, ' >> ', concat(e.first_name, ' ', e.last_name)), 
        concat(ep.path, ' >> ', e.employee_id)
    from
        employee_paths as ep
            join
        employees as e on ep.employee_id = e.manager_id
)
select
    *
from
    employee_paths
order by length(path), employee_id
limit 10
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
10 rows affected.

[(100, 'Steven King', 'Steven King', '100'),
 (101, 'Neena Kochhar', 'Steven King >> Neena Kochhar', '100 >> 101'),
 (102, 'Lex De Haan', 'Steven King >> Lex De Haan', '100 >> 102'),
 (114, 'Den Raphaely', 'Steven King >> Den Raphaely', '100 >> 114'),
 (120, 'Matthew Weiss', 'Steven King >> Matthew Weiss', '100 >> 120'),
 (121, 'Adam Fripp', 'Steven King >> Adam Fripp', '100 >> 121'),
 (122, 'Payam Kaufling', 'Steven King >> Payam Kaufling', '100 >> 122'),
 (123, 'Shanta Vollman', 'Steven King >> Shanta Vollman', '100 >> 123'),
 (124, 'Kevin Mourgos', 'Steven King >> Kevin Mourgos', '100 >> 124'),
 (145, 'John Russell', 'Steven King >> John Russell', '100 >> 145')]

In [9]:
%sql use dalba;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
0 rows affected.

[]

In [10]:
%%sql

select
    create_date, 
    sum(unit_price * quantity) as day_sales
from
    orders
group by create_date
order by create_date
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
5 rows affected.

[(datetime.datetime(2020, 8, 2, 1, 35, 15), Decimal('255.00')),
 (datetime.datetime(2020, 8, 3, 1, 35, 15), Decimal('88.00')),
 (datetime.datetime(2020, 8, 5, 1, 35, 15), Decimal('103.00')),
 (datetime.datetime(2020, 8, 8, 1, 35, 15), Decimal('72.00')),
 (datetime.datetime(2020, 8, 10, 1, 35, 15), Decimal('36.00'))]

In [11]:
%%sql

with recursive dates (date) as
(
    select '2020-08-01' 
        union all
    select
        date + interval 1 day
    from
        dates
    where
        date + interval 1 day <= '2020-08-20'
)
select
    *
from
    dates
limit 10
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
10 rows affected.

[('2020-08-01',),
 ('2020-08-02',),
 ('2020-08-03',),
 ('2020-08-04',),
 ('2020-08-05',),
 ('2020-08-06',),
 ('2020-08-07',),
 ('2020-08-08',),
 ('2020-08-09',),
 ('2020-08-10',)]

In [12]:
%%sql

with recursive dates (date) as
(
    select '2020-08-01' 
        union all
    select
        date + interval 1 day
    from
        dates
    where
        date + interval 1 day <= '2020-08-20'
)
select
    dates.date, 
    summary_sales.create_date, 
    coalesce(summary_sales.day_sales, 0) as day_sales
from
    dates
        left join
    (select
        create_date, sum(unit_price * quantity) as day_sales
    from
        orders
    group by create_date) as summary_sales on dates.date = date(summary_sales.create_date)
limit 10
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
10 rows affected.

[('2020-08-01', None, Decimal('0.00')),
 ('2020-08-02', datetime.datetime(2020, 8, 2, 1, 35, 15), Decimal('255.00')),
 ('2020-08-03', datetime.datetime(2020, 8, 3, 1, 35, 15), Decimal('88.00')),
 ('2020-08-04', None, Decimal('0.00')),
 ('2020-08-05', datetime.datetime(2020, 8, 5, 1, 35, 15), Decimal('103.00')),
 ('2020-08-06', None, Decimal('0.00')),
 ('2020-08-07', None, Decimal('0.00')),
 ('2020-08-08', datetime.datetime(2020, 8, 8, 1, 35, 15), Decimal('72.00')),
 ('2020-08-09', None, Decimal('0.00')),
 ('2020-08-10', datetime.datetime(2020, 8, 10, 1, 35, 15), Decimal('36.00'))]